
import req from '../lib/req.js';
import cheerio from '../lib/cheerio.min.js';

import fs from 'fs';
let baseUrl = "https://ylsp.tv";
function getYearFilter() {
    const years = [{ "n": "全部", "v": "" }];
    const currentYear = new Date().getFullYear().toString();
     for (let y = currentYear; y >= 2011; y--) {
        years.push({ "n": y.toString(), "v": y.toString()});
    }
    years.push({ "n": "更早", "v": "更早" });
    return {
        "key": "year",
        "name": "年份",
        "value": years
    };
}

const OtherFilters = [
    {
        "key": "area", "name": "地区", "value": [
            { "n": "全部", "v": "" }, { "n": "大陆", "v": "大陆" }, { "n": "香港", "v": "香港" },
            { "n": "台湾", "v": "台湾" }, { "n": "日本", "v": "日本" }, { "n": "韩国", "v": "韩国" },
            { "n": "欧美", "v": "欧美" }, { "n": "英国", "v": "英国" }, { "n": "泰国", "v": "泰国" },
            { "n": "其它", "v": "其它" }
        ]
    },
    {
        "key": "lang", "name": "语言", "value": [
            { "n": "全部", "v": "" }, { "n": "国语", "v": "国语" }, { "n": "英语", "v": "英语" },
            { "n": "粤语", "v": "粤语" }, { "n": "韩语", "v": "韩语" }, { "n": "日语", "v": "日语" },
            { "n": "西班牙", "v": "西班牙" }, { "n": "法语", "v": "法语" }, { "n": "德语", "v": "德语" },
            { "n": "意大利语", "v": "意大利语" }, { "n": "泰语", "v": "泰语" }, { "n": "其它", "v": "其它" }
        ]
    },
    {
        ...getYearFilter()
    },
    {
        "key": "letter", "name": "字母", "value": [
            { "n": "字母", "v": "" }, { "n": "A", "v": "A" }, { "n": "B", "v": "B" },
            { "n": "C", "v": "C" }, { "n": "D", "v": "D" }, { "n": "E", "v": "E" },
            { "n": "F", "v": "F" }, { "n": "G", "v": "G" }, { "n": "H", "v": "H" },
            { "n": "I", "v": "I" }, { "n": "J", "v": "J" }, { "n": "K", "v": "K" },
            { "n": "L", "v": "L" }, { "n": "M", "v": "M" }, { "n": "N", "v": "N" },
            { "n": "O", "v": "O" }, { "n": "P", "v": "P" }, { "n": "Q", "v": "Q" },
            { "n": "R", "v": "R" }, { "n": "S", "v": "S" }, { "n": "T", "v": "T" },
            { "n": "U", "v": "U" }, { "n": "V", "v": "V" }, { "n": "W", "v": "W" },
            { "n": "X", "v": "X" }, { "n": "Y", "v": "Y" }, { "n": "Z", "v": "Z" },
            { "n": "0-9", "v": "0-9" }
        ]
    },
    {
        "key": "orderBy", "name": "排序", "value": [
            { "n": "添加时间", "v": "time_add" }, { "n": "更新时间", "v": "time_update" },
            { "n": "人气排序", "v": "hits" }, { "n": "评分排序", "v": "score" }
        ]
    }
]

async function home(filter) {
    return JSON.stringify({
        class: [
            { type_id: "1", type_name: "电影" },
            { type_id: "2", type_name: "剧集" },
            { type_id: "3", type_name: "综艺" },
            { type_id: "4", type_name: "动漫" }
        ],
        filters: {
            "1": [
                {
                    "key": "type", "name": "类型", "value": [
                        { "n": "全部", "v": "" },
                        { "n": "动作片", "v": "6" },
                        { "n": "喜剧片", "v": "7" },
                        { "n": "爱情片", "v": "8" },
                        { "n": "科幻片", "v": "9" },
                        { "n": "奇幻片", "v": "10" },
                        { "n": "恐怖片", "v": "11" },
                        { "n": "剧情片", "v": "12" },
                        { "n": "战争片", "v": "20" },
                        { "n": "纪录片", "v": "21" },
                        { "n": "动画片", "v": "26" },
                        { "n": "悬疑片", "v": "22" },
                        { "n": "冒险片", "v": "23" },
                        { "n": "犯罪片", "v": "24" },
                        { "n": "惊悚片", "v": "45" },
                        { "n": "歌舞片", "v": "46" },
                        { "n": "灾难片", "v": "47" },
                        { "n": "网络片", "v": "48" }
                    ]
                },
                ...OtherFilters

            ],

            "2": [
                {
                    "key": "type", "name": "类型", "value": [
                        { "n": "全部", "v": "" },
                        { "n": "国产剧", "v": "13" },
                        { "n": "港台剧", "v": "14" },
                        { "n": "日剧", "v": "15" },
                        { "n": "韩剧", "v": "33" },
                        { "n": "欧美剧", "v": "16" },
                        { "n": "泰剧", "v": "34" },
                        { "n": "新马剧", "v": "35" },
                        { "n": "其他剧", "v": "25" }
                    ]
                },
               ...OtherFilters
            ],
            "3": [
                {
                    "key": "type", "name": "类型", "value": [
                        { "n": "全部", "v": "" },
                        { "n": "大陆综艺", "v": "27" },
                        { "n": "港台综艺", "v": "28" },
                        { "n": "日本综艺", "v": "29" },
                        { "n": "韩国综艺", "v": "36" },
                        { "n": "欧美综艺", "v": "30" },
                        { "n": "新马泰综艺", "v": "37" },
                        { "n": "其他综艺", "v": "38" }
                    ]
                },
               ...OtherFilters
            ],

            "4": [
                {
                  "key": "sub", "name": "类型", "value": [
                        { "n": "全部", "v": "" },
                        { "n": "国产动漫", "v": "31" },
                        { "n": "日本动漫", "v": "32" },
                        { "n": "韩国动漫", "v": "39" },
                        { "n": "港台动漫", "v": "40" },
                        { "n": "新马泰动漫", "v": "41" },
                        { "n": "欧美动漫", "v": "42" },
                        { "n": "其他动漫", "v": "43" }
                    ]
                },
              ...OtherFilters
            ]
        }
    });
}
console.log(await home())